---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures.LiningThicknessIsLargeForDiameter
source: html/a677a994-76a0-71aa-a5df-6b1c01cec76c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures.LiningThicknessIsLargeForDiameter Property

Lining Thickness ([Lining Thickness Value]) is too large for current Diameter ([Diameter Value]).

## Syntax (C#)
```csharp
public static FailureDefinitionId LiningThicknessIsLargeForDiameter { get; }
```